import java.util.Scanner;

public class less85 {
    public static void main(String[] args) { //Напишите программу на Java, чтобы проверить, начинается ли строка с указанного слова.

        String word = "Hello my dear";
        System.out.println(word.startsWith("Hello"));
    }
}
