public class less89 {
    public static void main(String[] args) { //Напишите программу на Java, чтобы получить текущую системную среду
                                            // и системные свойства.

        System.out.println("\nCurrent system environment: ");
        System.out.println(System.getenv());
        System.out.println("\n\nCurrent system properties:");
        System.out.println(System.getProperties());
    }
}
