public class less78 {
    public static void main(String[] args) { // Напишите программу на Java для проверки того, что заданный массив целых
        // чисел длины 2 содержит числа 4 или 7.

        int[] first = {4, 7};
        System.out.println(first.length==2 && first[0]==4 && first[1]==7);

    }
}
